In [2]:
import pymysql as py
print("Done")

Done

In [3]:
# user = "root"
# password = "ayush"

conn=py.connect(user="root",password="ayush",host="localhost",autocommit=True)

print("Connection established successfully")

Connection established successfully

In [4]:
cur = conn.cursor()
print("Done")

Done

In [5]:
#First query to create a database

query1 = '''
create database iitmDay5;


'''
cur.execute(query1)
print("Done")

Done

In [6]:
#Second query to use a database

query2='''
use iitmDay5;

'''
cur.execute(query2)
print("Done")

Done

In [ ]:
#Third query to create a table

query3 = '''
create table student_details
(
s_id int not null, 
s_name varchar(40),
s_course varchar(40),
s_address varchar(80),
scholarship float
);
'''

cur.execute(query3)
print("Done")

In [18]:
query4 = '''
insert into student_details
values
(102,"Sohan Sharma","BBA","Chandighar",7000.0);

'''

cur.execute(query4)
print("Done")

Done

In [22]:
query5 = '''
insert into student_details
values
(103,"Tilak Verma","BCA","Mayapuri",4500.0),
(104,"Somya","Bcom","Noida",6000.0);
'''

cur.execute(query5)
print("Done")

Done

In [33]:
n=3
for i in range(n):
    stuID= int(input("Enter Student ID:"))
    stuName=input("Enter your name:")
    stuCourse=input("Enter your course:")
    stuAddress=input("Enter your Address:")
    stuScholarship=float(input("Enter scholarship :"))
    
    query=f'''
    insert into student_details
    values
    ({stuID},"{stuName}","{stuCourse}","{stuAddress}",{stuScholarship});
    '''
    cur.execute(query)
    print("Record Insert Successfully")
print("Done")

Enter Student ID: 11
Enter your name: Harsh
Enter your course: BCA
Enter your Address: Shakurpur
Enter scholarship : 6600

Record Insert Successfully

Enter Student ID: 12
Enter your name: cheteneya
Enter your course: BCA
Enter your Address: Saket
Enter scholarship : 7700

Record Insert Successfully

Enter Student ID: 13
Enter your name: choudhary
Enter your course: BCA
Enter your Address: Rohini
Enter scholarship : 8200

Record Insert Successfully
Done

In [36]:
 query7 = '''
 select * from student_details;
 
 
 '''
cur.execute(query7)
records = cur.fetchall()

import pandas as pd
pd.DataFrame(records)

      0             1     2           3       4
0   101  Mohan Sharma   BCA       Delhi  5000.0
1   102  Sohan Sharma   BBA  Chandighar  7000.0
2   103   Tilak Verma   BCA    Mayapuri  4500.0
3   104         Somya  Bcom       Noida  6000.0
4   105           105     1           1     1.0
5     1             1     1           1     1.0
6   109      Divyansh   BCA      Rohini  6700.0
7   110         Harsh   BBA   Pitampura  5600.0
8    11         Harsh   BCA   Shakurpur  6600.0
9    12     cheteneya   BCA       Saket  7700.0
10   13     choudhary   BCA      Rohini  8200.0

In [47]:
all_columns = []
for i in cur.description:
    current_column=i[0]
    all_columns.append(current_column)
print(all_columns)

['s_id', 's_name', 's_course', 's_address', 'scholarship']

In [49]:
 query7 = '''
 select * from student_details;
 
 
 '''
cur.execute(query7)
records = cur.fetchall()

import pandas as pd
df=pd.DataFrame(records,columns=all_columns)

    s_id        s_name s_course   s_address  scholarship
0    101  Mohan Sharma      BCA       Delhi       5000.0
1    102  Sohan Sharma      BBA  Chandighar       7000.0
2    103   Tilak Verma      BCA    Mayapuri       4500.0
3    104         Somya     Bcom       Noida       6000.0
4    105           105        1           1          1.0
5      1             1        1           1          1.0
6    109      Divyansh      BCA      Rohini       6700.0
7    110         Harsh      BBA   Pitampura       5600.0
8     11         Harsh      BCA   Shakurpur       6600.0
9     12     cheteneya      BCA       Saket       7700.0
10    13     choudhary      BCA      Rohini       8200.0

In [60]:
def showRecords(db,table):
    
    
    query = f'''select * from {db}.{table};'''
     
     
    cur.execute(query)
    records = cur.fetchall()
    
    import pandas as pd
    df=pd.DataFrame(records,columns=all_columns)
    return df

In [61]:
showRecords("iitmday5","student_details")

    s_id        s_name s_course   s_address  scholarship
0    101  Mohan Sharma      BCA       Delhi       5000.0
1    102  Sohan Sharma      BBA  Chandighar       7000.0
2    103   Tilak Verma      BCA    Mayapuri       4500.0
3    104         Somya     Bcom       Noida       6000.0
4    105           105        1           1          1.0
5      1             1        1           1          1.0
6    109      Divyansh      BCA      Rohini       6700.0
7    110         Harsh      BBA   Pitampura       5600.0
8     11         Harsh      BCA   Shakurpur       6600.0
9     12     cheteneya      BCA       Saket       7700.0
10    13     choudhary      BCA      Rohini       8200.0